Repository: anthonydurand/option-tree
Catalog: languages/option-tree-*.po
Languages: fr_fr

source: The Colorpicker only allows valid hexadecimal values.
fr_fr: Le sélecteur de couleurs autorise seulement les valeurs hexadecimales valides.

source: Send to OptionTree
fr_fr: Envoyer à OptionTree

source: Remove Media
fr_fr: Enlever le Média

source: Are you sure you want to reset back to the defaults?
fr_fr: Etes-vous sûr de vouloir réinitialiser aux valeurs par défaut?

source: You can't remove this! But you can edit the values.
fr_fr: Vous ne pouvez pas supprimer ceci ! Mais vous pouvez modifier les valeurs.

source: Are you sure you want to remove this?
fr_fr: Etes-vous sûr de vouloir supprimer ceci ?

source: Are you sure you want to activate this layout?
fr_fr: Etes-vous sûr de vouloir activer cette mise en page ?

source: Sorry, you can't have settings three levels deep.
fr_fr: Désolé, vous ne pouvez pas avoir des paramètres avec plus de trois niveaux de profondeur.

source: General
fr_fr: Général

source: Sample Text Field Label
fr_fr: Libellé de champ texte (Exemple)

source: Description for the sample text field.
fr_fr: Description du champ de texte (Exemple)

source: Layout activated.
fr_fr: Mise en page activée.

source: Settings updated.
fr_fr: Paramètres mis à jour.

source: Settings could not be saved.
fr_fr: Les paramètres ne peuvent pas être enregistrés.

source: Settings Imported.
fr_fr: Paramètres importés.

source: Settings could not be imported.
fr_fr: Les paramètres ne peuvent pas être importés.

source: Data Imported.
fr_fr: Données importées.

source: Data could not be imported.
fr_fr: Les données ne peuvent pas être importées.

source: Layouts Imported.
fr_fr: Mises en page importées.

source: Layouts could not be imported.
fr_fr: Les mises en page ne peuvent pas être importées.

source: Layouts Updated.
fr_fr: Les mises en page ont été mises à jour.

source: Layouts could not be updated.
fr_fr: Les mises en page ne peuvent pas être mises à jour.

source: Background
fr_fr: Arrière-plan (Background)

source: Category Checkbox
fr_fr: Case à cocher de catégorie (Category Checkbox)

source: Category Select
fr_fr: Liste déroulante de catégorie (Category Select)

source: Checkbox
fr_fr: Case à cocher (Checkbox)

source: Colorpicker
fr_fr: Sélecteur de couleur (Colorpicker)

source: Custom Post Type Checkbox
fr_fr: Case à cocher de type d'article personalisé (Custom Post Type Checkbox)

source: Custom Post Type Select
fr_fr: Liste déroulante de type d'article personalisé (Custom Post Type Select)

source: List Item
fr_fr: Liste d'éléments (List Item)

source: Measurement
fr_fr: Mesures (Measurement)

source: Page Checkbox
fr_fr: Case à cocher de page (Page Checkbox)

source: Page Select
fr_fr: Liste déroulante de page (Page Select)

source: Post Checkbox
fr_fr: Case à cocher d'article (Post Checkbox)

source: Post Select
fr_fr: Liste déroulante d'article (Post Select)

source: Select
fr_fr: Liste déroulante (Select)

source: Slider
fr_fr: Curseur (Slider)

source: Tag Checkbox
fr_fr: Case à cocher de tag (Tag Checkbox)

source: Tag Select
fr_fr: Liste déroulante de tag (Tag Select)

source: Taxonomy Checkbox
fr_fr: Case à cocher de taxonomie (Taxonomy Checkbox)

source: Taxonomy Select
fr_fr: Liste déroulante de taxonomie (Taxonomy Select)

source: Text
fr_fr: Texte (Text)

source: Textarea
fr_fr: Zone de texte (Textarea)

source: Textarea Simple
fr_fr: Zone de texte simple (Textarea Simple)

source: Textblock
fr_fr: Bloc de texte (Textblock)

source: Textblock Titled
fr_fr: Bloc de texte avec titre (Textblock Titled)

source: Typography
fr_fr: Typographie (Typography)

source: Upload
fr_fr: Téléversement (Upload)

source: background
fr_fr: Arrière-plan (background)

source: category-select
fr_fr: Liste déroulante de catégorie (category-select)

source: category-checkbox
fr_fr: Case à cocher de catégorie

source: checkbox
fr_fr: Case à cocher

source: colorpicker
fr_fr: Sélecteur de couleur

source: text
fr_fr: texte

source: upload
fr_fr: téléversement (Upload)

source: measurement
fr_fr: Mesures

source: page-select
fr_fr: Liste déroulante de page

source: page-checkbox
fr_fr: Case à cocher de page

source: post-checkbox
fr_fr: Case à cocher

source: select
fr_fr: Liste déroulante

source: slider
fr_fr: curseur

source: tag-select
fr_fr: Liste déroulante de page

source: tag-checkbox
fr_fr: Case à cocher de page

source: textarea
fr_fr: zone de texte

source: textblock
fr_fr: bloc de texte

source: typography
fr_fr: typographie

source: Italic
fr_fr: Italic (Italique)

source: Inherit
fr_fr: Inherit (Hérité)

source: Bold
fr_fr: Bold (Gras)

source: Bolder
fr_fr: Bolder (Le plus gras)

source: Lighter
fr_fr: Lighter (Le Plus clair)

source: Small Caps
fr_fr: Small Caps (Petites majuscules)

source: No Repeat
fr_fr: No Repeat (Pas de répétition)

source: Repeat All
fr_fr: Repeat All (Tout répéter)

source: Repeat Horizontally
fr_fr: Repeat Horizontally (Répéter horizontalement)

source: Repeat Vertically
fr_fr: Repeat Vertically (Répéter verticalement)

source: Fixed
fr_fr: Fixed (Fixe)

source: Left Top
fr_fr: Left Top (Gauche Haut)

source: Left Center
fr_fr: Left Center (Gauche Centre)

source: Left Bottom
fr_fr: Left Bottom (Gauche Bas)

source: Center Top
fr_fr: Center Top (Centre Haut)

source: Center Center
fr_fr: Center Center (Centre Centre)

source: Center Bottom
fr_fr: Center Bottom (Centre Bas)

source: Right Top
fr_fr: Right Top (Droit Haut)

source: Right Center
fr_fr: Right Center (Droite Centre)

source: Right Bottom
fr_fr: Right Bottom (Droit Bas)

source: Left Sidebar
fr_fr: Barre latérale gauche

source: Right Sidebar
fr_fr: Barre latérale droite

source: Full Width (no sidebar)
fr_fr: Pleine largeur (pas de barre latérale)

source: Dual Sidebar
fr_fr: Double barre latérale

source: Left Dual Sidebar
fr_fr: Double barre latérale gauche

source: Right Dual Sidebar
fr_fr: Double barre latérale droite

source: Link
fr_fr: Lien

source: edit
fr_fr: éditer

source: Edit
fr_fr: Editer

source: Delete
fr_fr: Effacer

source: <strong>Section Title</strong>: Displayed as a menu item on the Theme Options page.
fr_fr: <strong>Titre de la section</strong> : Affiché comme un élément de menu sur la page Options du thème.

source: <strong>Section ID</strong>: A unique lower case alphanumeric string, underscores allowed.
fr_fr: <strong>ID de la section</strong> : Une chaine de caractères minuscule alphanumérique unique, tiret bas autorisés.

source: <strong>Label</strong>: Displayed as the label of a form element on the Theme Options page.
fr_fr: <strong>Libellé</strong> : Affiché comme libellé d'un élément de formulaire sur la page Options du thème.

source: <strong>ID</strong>: A unique lower case alphanumeric string, underscores allowed.
fr_fr: <strong>ID</strong> : Une chaine de caractères minuscule alphanumérique unique, tiret bas autorisés.

source: <strong>Type</strong>: Choose one of the available option types from the dropdown.
fr_fr: <strong>Type</strong> : Choisissez l'un des types d'options disponibles à partir de la liste déroulante.

source: <strong>Description</strong>: Enter a detailed description for the users to read on the Theme Options page, HTML is allowed. This is also where you enter content for both the Textblock & Textblock Titled option types.
fr_fr: <strong> Description</strong> : Entrez une description détaillée pour les utilisateurs à lire sur la page Options du thème, le HTML est autorisé. C'est également là que vous entrez du contenu à la fois pour les types d'options Bloc de texte et Bloc de texte avec titre .

source: <strong>Choices</strong>: This will only affect the following option types: Checkbox, Radio, Select & Select Image.
fr_fr: <strong>Choix</strong> : Cela affectera seulement les types d'options suivantes: Case à cocher, Radio, Liste déroulante & Choisir une image.

source: Add Choice
fr_fr: Ajouter un choix

source: <strong>Settings</strong>: This will only affect the List Item option type.
fr_fr: <strong>Paramètres</strong> : Cela affectera seulement le type d'option "Liste d'éléments".

source: Add Setting
fr_fr: Ajouter paramètre

source: <strong>Standard</strong>: Setting the standard value for your option only works for some option types. Read the <code>OptionTree->Documentation</code> for more information on which ones.
fr_fr: <strong>Standard</strong> : Le réglage de la valeur standard pour votre option ne fonctionne que pour certains types d'options. Lire le <code> OptionTree-> Documentation</code> pour plus d'informations sur lesquelles.

source: <strong>Rows</strong>: Enter a numeric value for the number of rows in your textarea. This will only affect the following option types: CSS, Textarea, & Textarea Simple.
fr_fr: <strong>Lignes</strong> : Entrez une valeur numérique pour le nombre de lignes dans votre zone de texte. Cela affectera seulement les types d'options suivantes: CSS, Zone de texte et Zone de texte simple.

source: <strong>Post Type</strong>: Add a comma separated list of post type like 'post,page'. This will only affect the following option types: Custom Post Type Checkbox, & Custom Post Type Select.
fr_fr: <strong>Type d'article</strong> : Ajouter une liste déroulante séparée par des virgules de type d'article comme 'post,page'. Cela affectera seulement les types d'options suivantes: Case à cocher de Type d'article personalisé et Liste déroulante de Type d'article personalisé .

source: <strong>Taxonomy</strong>: Add a comma separated list of any registered taxonomy like 'category,post_tag'. This will only affect the following option types: Taxonomy Checkbox, & Taxonomy Select.
fr_fr: <strong>Taxonomie</strong> : Ajouter une liste séparée par des virgules de toute taxonomie enregistrée comme 'categorie, post_tag'. Cela affectera seulement les types d'options suivantes : Case à cocher de Taxonomie et Liste déroulante de Taxonomie.

source: <strong>CSS Class</strong>: Add and optional class to this option type.
fr_fr: <strong>Classe CSS</strong> : Ajouter une classe CSS optionelle à ce type d'option.

source: Label
fr_fr: Libellé

source: Value
fr_fr: Valeur

source: Image Source (Radio Image only)
fr_fr: Source de l'image (Image du Radio seulement)

source: <strong>Title</strong>: Displayed as a contextual help menu item on the Theme Options page.
fr_fr: <strong>Titre</strong> : Affiché comme un élément de menu d'aide contextuelle sur la page Options du thème.

source: <strong>Content</strong>: Enter the HTML content about this contextual help item displayed on the Theme Option page for end users to read.
fr_fr: <strong>Contenu</strong> : Entrez le contenu HTML de l'aide contextuelle affichée pour l'élément que les utilisateurs finaux liront sur la page Options du thème.

source: Layout
fr_fr: Mise en page

source: Activate
fr_fr: Activer

source: Title
fr_fr: Titre

source: New Layout
fr_fr: Nouvelle mise en page

source: The Label field should be a short but descriptive block of text 100 characters or less with no HTML.
fr_fr: Le champ Libellé doit être un bloc court mais descriptif de texte de 100 caractères ou moins, sans HTML.

source: The ID field is a unique alphanumeric key used to differentiate each theme option (underscores are acceptable). Also, the plugin will change all text you write in this field to lowercase and replace spaces and special characters with an underscore automatically.
fr_fr: Le champ ID est une clé alphanumérique unique qui sert à différencier chaque option de thème (tiret bas est accepté). En outre, le plugin va changer tout le texte que vous écrivez dans ce champ en minuscules et remplacer les espaces et les caractères spéciaux avec un trait de soulignement automatiquement.

source: You are required to choose one of the supported option types when creating a new option. Here is a list of the available option types. For more information about each type click the <code>Option Types</code> tab to the left.
fr_fr: Vous êtes tenu de choisir l'un des types d'options prises en charge lors de la création d'une nouvelle option. Voici une liste des types d'options disponibles. Pour plus d'informations sur chaque type de cliquez sur l' onglet <code>Types d'options</code> à gauche.

source: Enter a detailed description for the users to read on the Theme Options page, HTML is allowed. This is also where you enter content for both the Textblock & Textblock Titled option types.
fr_fr: Entrez une description détaillée que les utilisateurs finaux liront sur la page Options du thème, le HTML est autorisé. C'est également là que vous entrez du contenu à la fois pour les types d'options Bloc de texte et Bloc de texte avec titre.

source: Choices
fr_fr: Choix

source: Click the "Add Choice" button to add an item to the choices array. This will only affect the following option types: Checkbox, Radio, Select & Select Image.
fr_fr: Cliquez sur le bouton "Ajouter Choix " pour ajouter un élément au tableau de choix. Cela affectera seulement les types d'options suivantes: Case à cocher, Radio, Liste déroulante & Sélectionner une image.

source: Settings
fr_fr: Paramètres

source: Click the "Add Setting" button found inside a newly created setting to add an item to the settings array. This will only affect the List Item type.
fr_fr: Cliquez sur le bouton "Ajoute paramètre" qui se trouve dans un paramètre nouvellement créé pour ajouter un élément au tableau des paramètres. Cela affectera seulement le type "Liste d'élément".

source: Setting the standard value for your option only works for some option types. Those types are one that have a single string value saved to them and not an array of values.
fr_fr: Définir la valeur standard pour votre option ne fonctionne que pour certains types d'options. Ces types sont celle qui ont une valeur de chaîne unique propre et non un tableau de valeurs.

source: Rows
fr_fr: Lignes

source: Enter a numeric value for the number of rows in your textarea. This will only affect the following option types: CSS, Textarea, & Textarea Simple.
fr_fr: Entrez une valeur numérique pour le nombre de lignes dans votre zone de texte. Cela affectera seulement les types d'options suivantes: CSS, Zone de texte et Zone de texte simple.

source: Post Type
fr_fr: Type d'article

source: Add a comma separated list of post type like <code>post,page</code>. This will only affect the following option types: Custom Post Type Checkbox, & Custom Post Type Select. Below are the default post types available with WordPress and that are also compatible with OptionTree. You can also add your own custom <code>post_type</code>. At this time <code>any</code> does not seem to return results properly and is something I plan on looking into.
fr_fr: Ajouter une liste de type d'article séparée par des virgules comme<code>post, page</code>. Cela affectera seulement les types d'options suivantes: Case à cocher de type d'article personnalisé (Custom Post Type Checkbox), et Liste déroulante de type d'article personnalisé (Custom Post Type Select). Voici les types d'article par défaut disponibles avec WordPress et qui sont également compatibles avec OptionTree. Vous pouvez également ajouter vos propres <code>post_type</code>. A l'heure actuelle <code>any</code> ne semble pas retourner des résultats bien que ce soit quelque chose que j'ai l'intention d'intégrer.

source: Taxonomy
fr_fr: Taxonomie

source: Add a comma separated list of any registered taxonomy like <code>category,post_tag</code>. This will only affect the following option types: Taxonomy Checkbox, & Taxonomy Select.
fr_fr: Ajouter une liste de toute taxinomie séparée par des virgules comme<code>category,post_tag</code>. Cela affectera seulement les types d'options suivantes : Case à cocher de taxonomie et Liste déroulante de taxonomie.

source: The Background option type is for adding background styles to your theme either dynamically via the CSS option type below or manually with <code>ot_get_option()</code>. Background has filters that allow you to change the defaults. For example, you can filter on <code>ot_recognized_background_repeat</code>, <code>ot_recognized_background_attachment</code>, and <code>ot_recognized_background_position</code>. These filters allow you to fine tune the select lists for your specific CSS needs.
fr_fr: Le type d'option "Arrière-plan" est pour ajouter des styles d'arrière-plan à votre thème soit dynamiquement via le type d'option CSS ci-dessous ou manuellement avec <code>ot_get_option()</code>. "Arrière-plan" est doté de filtres qui vous permettent de changer les valeurs par défaut. Par exemple, vous pouvez filtrer par <code>ot_recognized_background_repeat</code>,<code>ot_recognized_background_attachment</code> et <code>ot_recognized_background_position</code>. Ces filtres vous permettent d'affiner les listes de sélection pour vos besoins spécifiques CSS.

source: The Category Select option type displays a list of category IDs. It allows the user to select only one category ID and will return that value for use in a custom function or loop.
fr_fr: Le type d'option "Liste déroulante de catégorie" affiche une liste des ID de catégorie. Il permet à l'utilisateur de sélectionner un seul ID de catégorie et retournera cette valeur pour une utilisation dans une fonction personnalisée ou une boucle.

source: The Category Checkbox option type displays a list of category IDs. It allows the user to check multiple category IDs and will return that value as an array for use in a custom function or loop.
fr_fr: Le type d'option "Case à cocher de catégorie" affiche une liste des ID de catégorie. Il permet à l'utilisateur de cocher de multiples ID de catégorie et renvoie cette valeur comme un tableau pour une utilisation dans une fonction personnalisée ou une boucle.

source: The Checkbox option type is fairly self explanatory. Typically used to ask questions. For example, "Do you want to activate asynchronous Google analytics?" would be a single checkbox with a value of yes. You could have more complex usages but the idea is that you can easily grab the value of the checkbox and use it in you theme. In this situation you would test if the checkbox has a value and execute a block of code if it does and do nothing if it doesn't.
fr_fr: Le type d'option à cocher est assez explicite. Généralement utilisé pour poser des questions. Par exemple, "Voulez-vous pour activer Google Analytics asynchrone?" serait une seule case avec la valeur oui. Vous pourriez avoir des usages plus complexes, mais l'idée est que vous pouvez facilement saisir la valeur de la case à cocher et l'utiliser dans votre thème. Dans cette situation, vous pouvez tester si la case a une valeur et exécuter un bloc de code si c'est le cas et ne rien faire si ce n'est pas le cas.

source: The Colorpicker option type saves a hexadecimal color code for use in CSS. Use it to modify the color of something in your theme.
fr_fr: Le type d'option "Sélecteur de couleur (Colorpicker)" enregistre un code de couleur hexadécimal pour une utilisation en CSS. Utilisez-le pour modifier la couleur de quelque chose dans votre thème.

source: The CSS option type is a textarea that when used properly can add dynamic CSS to your theme from within OptionTree. Unfortunately, due server limitations you will need to create a file named <code>dynamic.css</code> at the root level of your theme and change permissions using chmod so the server can write to the file. I have had the most success setting this single file to 0777 but feel free to play around with permissions until everything is working. A good starting point is 0666. When the server can save to the file CSS will automatically be updated each time you save your theme options.
fr_fr: Le type d'option "CSS" est une zone de texte qui lorsqu'il est utilisé correctement peut ajouter du CSS dynamique à votre thème depuis OptionTree. Malheureusement, en raison des limitations du serveur, vous devrez créer un fichier nommé <code>dynamic.css</code> au niveau de la racine de votre thème et modifier les permissions en utilisant chmod afin que le serveur peut écrire dans le fichier. J'ai eu le plus de succès permission de ce fichier à 0777, mais n'hésitez pas à jouer avec les autorisations jusqu'à ce que tout fonctionne. Un bon point de départ est 0666. Lorsque le serveur peut enregistrer sur le fichier, CSS sera automatiquement mis à jour chaque fois que vous enregistrez vos options de thème.

source: An example of the CSS option type: This assumes you have an option with the ID of <code>custom_background_css</code> which will display the saved values for that option.
fr_fr: Un exemple du type d'option "CSS" : Cela suppose que vous avez une option avec l'ID <code>custom_background_css</code> qui permet d'afficher les valeurs enregistrées pour cette option.

source: Input
fr_fr: Entrée

source: Output
fr_fr: Sortie

source: The Custom Post Type Select option type displays a list of IDs from any available WordPress post type or custom post type. It will return a single post ID for use in a custom function or loop. Requires at least one valid <code>post_type</code> when created in the settings. For some reason <code>any</code> does not work correctly and will looked into in future version.
fr_fr: L'option "Liste déroulante de type d'article personalisé (Custom post Type)" affiche une liste d'ID de n'importe quel type d'article de Wordpress disponible ou de type d'article personnalisé. Il retournera un ID de poste unique pour utilisation dans une fonction personnalisée ou une boucle. Nécessite au moins un <code>post_tye</code> valide lors de sa création dans les paramètres. Pour certaines raisons <code>any</code> ne fonctionne pas correctement et sera mis à jour dans une version future.

source: The Custom Post Type Select option type displays a list of IDs from any available WordPress post type or custom post type. It allows the user to check multiple post IDs for use in a custom function or loop. Requires at least one valid <code>post_type</code> when created in the settings. For some reason <code>any</code> does not work correctly and will looked into in future version.
fr_fr: L'option "Liste déroulante de type d'article personalisé (Custom post Type)" affiche une liste d'ID de n'importe quel type d'article de Wordpress disponible ou de type d'article personnalisé. Il permet à l'utilisateur de slélectionner de multiples ID de poste pour utilisation dans une fonction personnalisée ou une boucle. Nécessite au moins un <code>post_tye</code> valide lors de sa création dans les paramètres. Pour certaines raisons <code>any</code> ne fonctionne pas correctement et sera mis à jour dans une version future.

source: The list Item replaced the old Slider option type. It allows for a great deal of customization. You can add settings to the List Item and those settings will be displayed to the user when they add a new List Item. Typical use is for creating sliding content or blocks of code for custom layouts.
fr_fr: La liste d'élément a remplacé l'ancienne option "Type de curseur". Il permet une grande personnalisation. Vous pouvez ajouter des paramètres à la liste d'élément et ces paramètres seront affichés à l'utilisateur quand il ajoute un nouvel élément de liste. Une utilisation typique est pour la création de contenu mobile ou des blocs de code pour des présentations personnalisées.
