Repository: anthonydurand/option-tree
Catalog: languages/option-tree-*.po
Languages: fr_fr

source: Option types in alphabetical order & hooks to filter them.
fr_fr: Types d'options dans l'ordre alphabétique et astuces pour les filtrer.

source: Function Reference:ot_get_option()
fr_fr: Référence de fonction : ot_get_option()

source: Function Reference:get_option_tree()
fr_fr: Référence de fonction : get_option_tree()

source: Code examples for front-end development.
fr_fr: Les exemples de code pour développement front-end.

source: What's a layout anyhow?
fr_fr: Qu'est-ce qu'une mise en page ?
