Repository: anthonydurand/option-tree
Catalog: languages/option-tree-*.po
Languages: fr_fr

source: Modify and save your theme options and the layout will be updated automatically.
fr_fr: Modifiez et enregistrez vos options de thème et la mise en page sera mise à jour automatiquement.

source: Saving theme options data will update the currently active layout, so before you start saving make sure you want to modify the current layout.
fr_fr: Sauver les de données d'options de thème mettra à jour la mise en page actuellement active, alors avant de commencer à enregistrer, assurez-vous de vouloir modifier la configuration actuelle.

source: If you want to edit a new layout, first create it then save your theme options.
fr_fr: Si vous souhaitez editer une nouvelle mise en page, créer la d'abord et ensuite enregistrer vos options de thème.

source: End-Users Mode
fr_fr: Mode Utilisateur Final

source: Enter a name for your layout in the text field and hit "New Layout", you've created your first layout.
fr_fr: Entrez un nom pour votre mise en page dans le champ texte et cliquez sur "Nouvelle mise en page ", vous avez créé votre première mise en page.

source: Choose a layout from the select list and click the "Activate Layout" button.
fr_fr: Choisissez une mise en page dans la liste déroulante et cliquez sur le bouton "Activer mise en page".

source: End-Users mode does not allow deleting layouts.
fr_fr: Le mode utilisateur final ne permet pas la suppression de mises en page.

source: Go to the <code>Appearance->Theme Options</code> tab.
fr_fr: Allez à l'onglet <code>Apparence->Options du thème</code>.

source: How-to-guide
fr_fr: Guide du "Comment-faire"

source: There are a few simple steps you need to take in order to use OptionTree's built in Meta Box API. In the code below I'll show you a basic demo of how to create your very own custom meta box using any number of the option types you have at your disposal. If you would like to see some demo code, there is a directory named <code>theme-mode</code> inside the <code>assets</code> directory that contains a file named <code>demo-meta-boxes.php</code> you can reference.
fr_fr: Il y a quelques étapes simples que vous devez prendre dans l'ordre afin de pouvoir utiliser l'API Meta Box incluse dans OptionTree. Dans le code ci-dessous je vais vous montrer une démo de base sur la façon de créer votre MetaBox personnalisée à l'aide de n'importe quel nombre d'options de type que vous avez à votre disposition. Si vous souhaitez voir un peu de code de démonstration, il y a un répertoire nommé <code>theme-mode</code> à l'intérieur du répertoire <code>assets</code> qui contient un fichier nommé <code>demo-meta-boxes.php</code> auquel vous pouvez vous référer.

source: It's important to note that Meta Boxes do not support WYSIWYG editors at this time and if you set one of your options to Textarea it will automatically revert to a Textarea Simple until a valid solution is found. WordPress released this statement regarding the wp_editor() function:
fr_fr: Il est important de noter que les MetaBox ne prennent pas en charge les éditeurs WYSIWYG en ce moment et si vous définissez l'une de vos options en "Zone de texte (Textarea)" elle sera automatiquement convertie en une "Zone de texte simple (Textarea simple)" jusqu'à ce qu'une solution valable ne soit trouvée. WordPress a publié la déclaration suivante concernant la fonction wp_editor() :

source: Once instantiated, the WYSIWYG editor cannot be moved around in the DOM. What this means in practical terms, is that you cannot put it in meta-boxes that can be dragged and placed elsewhere on the page.
fr_fr: Une fois instancié, l'éditeur WYSIWYG ne peut pas être déplacé dans les DOM. Ce qui signifie en termes pratiques, que vous ne pouvez pas le mettre dans des MetaBox qui peuvent être glissés et placés ailleurs sur la page.

source: Create and include your custom meta boxes file.
fr_fr: Créer et inclure votre fichier de MetaBox personnalisée.

source: Create a file and name it anything you want, maybe <code>meta-boxes.php</code>.
fr_fr: Créer un fichier et nommez-le comme vous voulez, peut-être <code>meta-boxes.php</code>.

source: As well, you'll probably want to create a directory named <code>includes</code> to put your <code>meta-boxes.php</code> into which will help keep you file structure nice and tidy.
fr_fr: En outre, vous aurez probablement envie de créer un répertoire nommé <code>includes</code> pour mettre votre <code>meta-boxes.php</code> dedans, cela vous aidera à garder une structure de fichier agréable et soignée.

source: Add the following code to your <code>functions.php</code>.
fr_fr: Ajouter le code suivant à votre <code>functions.php</code>.

source: Add a variation of the following code to your <code>meta-boxes.php</code>. You'll obviously need to fill it in with all your custom array values. It's important to note here that we use the <code>admin_init</code> filter because if you were to call the <code>ot_register_meta_box</code> function before OptionTree was loaded the sky would fall on your head.
fr_fr: Ajouter une variation du code suivant à votre <code>meta-boxes.php</code>. Vous aurez évidemment besoin de le remplir avec toutes vos tableaux de valeurs personnalisées. Il est important de noter ici que nous utilisons le filtre <code>admin_init</code>parce que si vous aviez appelé la fonction <code>ot_register_meta_box</code> avant que OptionTree n'aie été chargé le ciel vous tomberait sur la tête.

source: There are a few simple steps you need to take in order to use OptionTree as a theme included module. In the code below I'll show you a basic demo of how to include the entire plugin as a module, which will allow you to have the most up-to-date version of OptionTree without ever needing to hack the core of the plugin. If you would like to see some demo code, there is a directory named <code>theme-mode</code> inside the <code>assets</code> directory that contains a file named <code>demo-theme-options.php</code> you can reference.
fr_fr: Il y a quelques étapes simples que vous devez prendre dans l'ordre afin de pouvoir utiliser OptionTree comme un module inclus dans un thème. Dans le code ci-dessous je vais vous montrer une démo de base sur la façon d'inclure le plugin entier en tant que module, qui vous permettra d'avoir la version la plus à jour de OptionTree sans jamais avoir besoin de pirater le noyau du plugin. Si vous souhaitez voir un peu de code démo, il ya un répertoire nommé <code>theme-mode</code> à l'intérieur du répertoire <code>assets</code> qui contient un fichier nommé <code>demo-theme-options.php</code> auquel vous pouvez vous référer.

source: Step 1: Include the plugin & turn on theme mode.
fr_fr: Étape 1: Inclure le plugin & activer le mode thème.

source: Download the latest version of <a href="http://wordpress.org/extend/plugins/option-tree/" rel="nofollow" target="_blank">OptionTree</a>.
fr_fr: Télécherger la dernière version de <a href="http://wordpress.org/extend/plugins/option-tree/" rel="nofollow" target="_blank">OptionTree</a>.

source: Unpack the ZIP archive.
fr_fr: Décompressez l'archive ZIP.

source: Put the <code>option-tree</code> directory in the root of your theme. For example, the server path would be <code>/wp-content/themes/theme-name/option-tree/</code>.
fr_fr: Mettre le répertoire <code>option-tree</code> à la base de votre thème. par exemple, le chemin du serveur pourrait être <code>/wp-content/themes/theme-name/option-tree/</code>.

source: Add the following code to the beginning of your <code>functions.php</code>.
fr_fr: Ajouter le code suivant à votre <code>functions.php</code>.

source: It's that simple! You now have OptionTree built into your theme and anytime there's an update to the plugin you just replace the old version and you're good to go..
fr_fr: C'est aussi simple que cela! Vous avez maintenant OptionTree inclus dans votre thème et, à tout moment, s'il y a une mise à jour du plugin, vous aurez juste a remplacer l'ancienne version par la nouvelle et vous êtes bon.

source: Step 2: Create Theme Options without using the UI Builder.
fr_fr: Étape 2: Créer les options du thème sans l'aide du Générateur d'UI.

source: Create a file and name it anything you want, maybe <code>theme-options.php</code>, or use the built in file export to create it for you. Remember, you should always check the file for errors before including it in your theme.
fr_fr: Créer un fichier et nommez-le comme vous voulez, peut-être <code>theme-options.php</code>; ou utiliser l'exportation de fichier incluse pour le créer pour vous. Rappelez-vous, vous devriez toujours vérifier que le fichier ne contient pas d'erreurs avant de l'inclure dans votre thème.

source: As well, you'll probably want to create a directory named <code>includes</code> to put your <code>theme-options.php</code> into which will help keep you file structure nice and tidy.
fr_fr: En outre, vous aurez probablement envie de créer un répertoire nommé <code>includes</code> pour mettre votre <code>theme-options.php</code> ce qui vous aidera à garder votre structure de fichiers bien structurée et bien rangée.

source: Add a variation of the following code to your <code>theme-options.php</code>. You'll obviously need to fill it in with all your custom array values for contextual help (optional), sections (required), and settings (required).
fr_fr: Ajouter une variation du code suivant à votre <code>theme-options.php</code>. Vous aurez évidemment besoin de le remplir avec toutes vos tableaux de valeurs personnalisées pour l'aide contextuelle (en option), des sections (obligatoire), et les paramètres (obligatoire).

source: The code below is a boilerplate to get your started. For a full list of the available option types click the "Option Types" tab above. Also a quick note, you don't need to put OptionTree in theme mode to manually create options but you will want to hide the docs and settings as each time you load the admin area the settings will be written over with the code below if they've changed in any way. However, this ensures your settings do not get tampered with by the end-user.
fr_fr: Le code ci-dessous est une base pour vous permettre de débuter. Pour une liste complète des types d'options disponibles, cliquez sur l'onglet "Types d'option" ci-dessus. Aussi un petit mot, vous n'avez pas besoin de mettre OptionTree en mode thème pour créer manuellement les options, mais si vous souhaitez masquer les docs et les paramètres à chaque fois que vous chargez la zone d'administration, les paramètres seront réécris avec le code ci-dessous si elles ont changé de quelque façon. Cependant, c'est ce ce qui assure que vos paramètres ne soient pas altérés par l'utilisateur final.

source: Sorry, this function does not exist
fr_fr: Désolé, cette fonction n'existe pas

source: Add Media
fr_fr: Ajouter média

source: No Categories Found
fr_fr: Aucune catégorie trouvée

source: Choose One
fr_fr: Choisissez un/une

source: No Posts Found
fr_fr: Aucun article trouvé

source: Add New
fr_fr: Ajouter nouveau

source: You can re-order with drag & drop, the order will update after saving.
fr_fr: Vous pouvez ré-arranger avec le glisser/déposer, la commande sera mise à jour après l'enregistrement.

source: No Pages Found
fr_fr: Aucune page trouvée

source: No Tags Found
fr_fr: Aucun tag trouvé

source: No Taxonomies Found
fr_fr: Aucune taxonomie trouvée

source: Warning!
fr_fr: Attention !

source: Go to the %s page if you want to save data, this page is for adding settings.
fr_fr: Allez sur la page %s si vous voulez sauver vos données, cette page sert à ajouter des paramètres.

source: <code>Appearance->Theme Options</code>
fr_fr: <code>Apparence->Options du thème</code>

source: If you're unsure or not completely positive that you should be editing these settings, you should read the %s first.
fr_fr: Si vous n'êtes pas sûr de devoir modifier ces paramètres, vous devriez lire d'abord lire %s.

source: Things could break or be improperly displayed to the end-user if you do one of the following:
fr_fr: Les options pourraient mal fonctionner ou être mal affichées à l'utilisateur final si vous effectuez l'une des opérations suivantes:

source: Give two sections the same ID, give two settings the same ID, give two contextual help content areas the same ID, don't create any settings, or have a section at the end of the settings list.
fr_fr: Donner à deux sections le même ID, donner à deux options le même ID, donner à deux zones d'aide contextuelle le même ID, ne pas créer du tout d'options ou avoir une section à la fin de la liste d'options.

source: You can create as many settings as your project requires and use them how you see fit. When you add a setting here, it will be available on the Theme Options page for use in your theme. To separate your settings into sections, click the "Add Section" button, fill in the input fields, and a new navigation menu item will be created.
fr_fr: Vous pouvez créer autant de paramètres que votre projet en nécessite et les utiliser comme bon vous semble. Lorsque vous ajoutez un paramètre ici, il sera disponible sur la page Options du thème pour une utilisation dans votre thème. Pour séparer vos paramètres en sections, cliquez sur le bouton "Ajouter une section", remplissez les champs d'entrée, et un nouvel élément de menu de navigation sera créé.

source: All of the settings can be sorted and rearranged to your liking with Drag & Drop. Don't worry about the order in which you create your settings, you can always reorder them.
fr_fr: Tous les paramètres peuvent être triés et ré-arrangés à votre goût par Glisser/Déposer. Ne vous inquiétez pas de l'ordre dans lequel vous créez vos paramètres, vous pouvez toujours les réorganiser.

source: Add Section
fr_fr: Ajouter une section

source: Save Changes
fr_fr: Sauver les changements

source: Contextual Help
fr_fr: Aide contextuelle

source: Contextual Help Sidebar
fr_fr: Barre latérale d'aide contextuelle

source: If you decide to add contextual help to the Theme Option page, enter the optional "Sidebar" HTML here. This would be an extremely useful place to add links to your themes documentation or support forum. Only after you've added some content below will this display to the user.
fr_fr: Si vous décidez d'ajouter une aide contextuelle à la page d'options du thème, entrez l'optionnel code HTML "Barre latérale" ici. Ce serait un endroit extrêmement utile pour ajouter des liens vers la documentation de votre thème ou votre forum de support. C'est seulement après que vous ayez ajouté du contenu ci-dessous que l'utilisateur final le verra.

source: Add Contextual Help Content
fr_fr: Ajouter du contenu d'aide contextuelle

source: This import method has been deprecated. That means it has been replaced by a new method and is no longer supported, and may be removed from future versions. All themes that use this import method should be converted to use its replacement below.
fr_fr: Cette méthode d'importation a été dépréciée. Cela signifie qu'elle a été remplacée par une nouvelle méthode et n'est plus supportée, et peut être enlevée des futures versions. Tous les thèmes qui utilisent cette méthode d'importation devraient être convertis pour utiliser son remplacement ci-dessous.

source: If you were given a Theme Options XML file with a premium or free theme, locate it on your hard drive and upload that file by clicking the blue upload button. A popup window will appear, upload the XML file and click "Send to OptionTree". The file URL should be in the upload input, if it is click "Import XML".
fr_fr: Si vous avez reçu un fichier XML Options du thème avec un thème premium ou gratuit, localisez le sur votre disque dur et téléverser ce fichier en cliquant sur le bouton bleu de téléversement (Upload). Une fenêtre apparaîtra, téléverser le fichier XML, puis cliquez sur "Envoyer à OptionTree". L'URL du fichier devrait être dans le champ de téléversement (Upload), si elle y est, cliquer sur "Importer XML".

source: Import XML
fr_fr: Importer XML

source: Add XML
fr_fr: Ajouter XML

source: To import your Settings copy and paste what appears to be a random string of alpha numeric characters into this textarea and press the "Import Settings" button.
fr_fr: Pour importer vos paramètres, copier et coller ce qui semble être une chaîne aléatoire de caractères alphanumériques dans cette zone de texte et appuyez sur le bouton "Importer les paramètres".

source: Import Settings
fr_fr: Importer les paramètres

source: Only after you've imported the Settings should you try and update your Theme Options.
fr_fr: C'est seulement après avoir importé les paramètres que vous devriez essayer de mettre à jour vos options de thème.

source: To import your Theme Options copy and paste what appears to be a random string of alpha numeric characters into this textarea and press the "Import Theme Options" button.
fr_fr: Pour importer vos options de thème, copier et coller ce qui semble être une chaîne aléatoire de caractères alphanumériques dans cette zone de texte et appuyez sur le bouton "Import des options du thème".

source: Import Theme Options
fr_fr: Import des options du thème

source: Only after you've imported the Settings should you try and update your Layouts.
fr_fr: C'est seulement après avoir importé les paramètres que vous devriez essayer de mettre à jour vos mises en page.

source: To import your Layouts copy and paste what appears to be a random string of alpha numeric characters into this textarea and press the "Import Layouts" button. Keep in mind that when you import your layouts, the active layout's saved data will write over the current data set for your Theme Options.
fr_fr: Pour importer votre copie de mises en page, copier et coller ce qui semble être une chaîne aléatoire de caractères alphanumériques dans cette zone de texte et appuyez sur le bouton "Import des mises en page". Gardez à l'esprit que lorsque vous importez vos mises en page, les données importées écraseront vos mises en page actuelle configurées dans les options de votre thème.

source: Import Layouts
fr_fr: Import des mises en page

source: Export your Settings into a fully functional <code>theme-options.php</code> file by clicking this button. For more information on how to use this file read the theme mode %s. Remember, you should always check the file for errors before including it in your theme.
fr_fr: Exporter vos options dans un fichier <code>theme-options.php</code> pleinement fonctionnel en cliquant sur ce bouton. Pour plus d'informations sur l'utilisation de ce fichier, lire le mode theme dans %s. Mais rappelez-vous, vous devez toujours vérifier l'absence d'erreurs dans votre fichier avant de l'inclure dans votre theme.

source: Export Settings File
fr_fr: Exporter un fichier de vos options

source: Export your Settings by highlighting this text and doing a copy/paste into a blank .txt file. Then save the file for importing into another install of WordPress later. Alternatively, you could just paste it into the <code>OptionTree->Settings->Import</code> <strong>Settings</strong> textarea on another web site.
fr_fr: Exportez vos paramètres en surlignant ce texte et en faisant un copier/coller dans un fichier .txt vide. Ensuite, enregistrez le fichier sur votre disque dur, vous pourrez l'importer dans une autre installation de WordPress plus tard. Sinon, vous pouvez simplement le coller dans la zone de texte <strong>Paramètres</strong><code>OptionTree->Paramètres->Importer</code> sur un autre site web.

source: Export your Theme Options data by highlighting this text and doing a copy/paste into a blank .txt file. Then save the file for importing into another install of WordPress later. Alternatively, you could just paste it into the <code>OptionTree->Settings->Import</code> <strong>Theme Options</strong> textarea on another web site.
fr_fr: Exportez vos données d'option de thème en surlignant ce texte et en faisant un copier/coller dans un fichier .txt vide. Ensuite, enregistrez le fichier sur votre disque dur, vous pourrez l'importer dans une autre installation de WordPress plus tard. Sinon, vous pouvez simplement le coller dans la zone de texte <strong>Paramètres</strong><code>OptionTree->Paramètres->Importer</code> sur un autre site web.

source: Export your Layouts by highlighting this text and doing a copy/paste into a blank .txt file. Then save the file for importing into another install of WordPress later. Alternatively, you could just paste it into the <code>OptionTree->Settings->Import</code> <strong>Layouts</strong> textarea on another web site.
fr_fr: Exportez vos mises en page en surlignant ce texte et en faisant un copier/coller dans un fichier .txt vide. Ensuite, enregistrez le fichier sur votre disque dur, vous pourrez l'importer dans une autre installation de WordPress plus tard. Sinon, vous pouvez simplement le coller dans la zone de texte <strong>Mises en page</strong><code>OptionTree->Paramètres->Importer</code> sur un autre site web.

source: To add a new layout enter a unique lower case alphanumeric string (dashes allowed) in the text field and click "Save Layouts".
fr_fr: Pour ajouter une nouvelle mise en page, entrer une chaîne alphanumérique unique (tiret permis) dans le champ texte et cliquez sur "Enregistrer mise en page".

source: As well, you can activate, remove, and drag & drop the order; all situations require you to click "Save Layouts" for the changes to be applied.
fr_fr: En outre, vous pouvez activer, supprimer et glissez-déposez l'ordre; quoi que vous fassiez, il faut que vous cliquiez sur "Enregistrer les mises en page" pour que les modifications soient appliquées.

source: When you create a new layout it will become active and any changes made to the Theme Options will be applied to it. If you switch back to a different layout immediately after creating a new layout that new layout will have a snapshot of the current Theme Options data attached to it.
fr_fr: Lorsque vous créez une nouvelle mise en page, elle deviendra active et toutes les modifications apportées aux options du thème seront appliquées. Si vous revenez à une mise en page différente immédiatement après la création d'une nouvelle mise en page, cette nouvelle mise en page aura un aperçu des données actuelles des options du thème qui lui sont attachées.

source: Visit <code>OptionTree->Documentation->Layouts Overview</code> to see a more in-depth description of what layouts are and how to use them.
fr_fr: Visitez <code>OptionTree-> Documentation->Aperçu des mises en page</code> pour voir plus en profondeur ce que sont les mises en page et comment les utiliser.

source: Save Layouts
fr_fr: Enregistrer les mises en pages

source: Reset Options
fr_fr: Reset des options

source: Theme Options updated.
fr_fr: Options du thème mises à jour.

source: Theme Options reset.
fr_fr: Reset des options du thème

source: Save Settings
fr_fr: Enregistrer les paramètres

source: Theme Options UI
fr_fr: UI pour les options du thème

source: Layouts
fr_fr: Mises en pages

source: Theme Options UI Builder
fr_fr: Générateur d'UI (Interface Utilisateur) pour les options de votre thème

source: Settings XML
fr_fr: Options XML

source: Theme Options
fr_fr: Options du thème

source: Settings PHP File
fr_fr: Fichier PHP de vos options

source: Add, Activate, & Remove Layouts
fr_fr: Ajouter, activer ou supprimer des mises en page

source: Creating Options
fr_fr: Création d'options

source: Option Types
fr_fr: Types d'options

source: Function References
fr_fr: Références de fonction

source: Theme Mode
fr_fr: Mode Thème

source: Code Examples
fr_fr: Exemples de code

source: Layouts Overview
fr_fr: Vue d'ensemble des mises en page

source: Overview of available Theme Option fields.
fr_fr: Vue d'ensemble des champs disponibles pour les options de thème.
