Repository: anthonydurand/option-tree
Catalog: languages/option-tree-*.po
Languages: fr_fr

source: The Measurement option type is a mix of input and select fields. The text input excepts a value and the select lets you choose the unit of measurement to add to that value. Currently the default units are <code>px</code>, <code>%</code>, <code>em</code>, <code>pt</code>. However, you can change them with the <code>ot_measurement_unit_types</code> filter.
fr_fr: Le type d'option "Mesure" est un mélange d'entrée et de champs de sélection. La saisie de texte attend une valeur et la sélection vous permet de choisir l'unité de mesure à ajouter à cette valeur. Actuellement, les unités par défaut sont <code>px</code>, <code>%</code>, <code>em</code>, <code>pt</code>. Cependant, vous pouvez les modifier avec le filtre <code>ot_measurement_unit_types</code>.

source: Example filter to add new units to the Measurement option type. Added to <code>functions.php</code>.
fr_fr: Exemple de filtre pour ajouter de nouvelles unités au type d'option "Mesure". Ajouté à <code>functions.php</code>.

source: Example filter to completely change the units in the Measurement option type. Added to <code>functions.php</code>.
fr_fr: Exemple de filtre pour changer complètement les unités du type d'option "Mesure". Ajouté à <code>functions.php</code>.

source: The Page Select option type displays a list of page IDs. It will return a single page ID for use in a custom function or loop.
fr_fr: Le type d'option "Liste déroulante de page" affiche une liste d'ID de page. Il retournera un seul ID de page pour une utilisation dans une fonction personnalisée ou une boucle.

source: The Page Select option type displays a list of page IDs. It allows the user to check multiple page IDs for use in a custom function or loop.
fr_fr: Le type d'option Sélection de page affiche une liste d'ID de page. Il permet à l'utilisateur de vérifier les ID de plusieurs pages pour une utilisation dans une fonction personnalisée ou une boucle.

source: The Post Select option type displays a list of post IDs. It will return a single post ID for use in a custom function or loop.
fr_fr: Le type d'option "Liste déroulante d'article (Post Select )" affiche une liste des ID d'articles. Il retournera une seule ID d'article pour une utilisation dans une fonction personnalisée ou une boucle.

source: The Post Select option type displays a list of post IDs. It allows the user to check multiple post IDs for use in a custom function or loop.
fr_fr: Le type d'option "Liste déroulante d'article (Post select)" affiche une liste d'ID d'articles .Il permet à l'utilisateur de sélectionner de multiple ID d'articles pour une utilisation dans une fonction personnalisée ou une boucle.

source: The Radio option type could ask a question. For example, "Do you want to activate the custom navigation?" could require a yes or no answer with a radio option. In this situation you would test if the radio has a value of 'yes' and execute a block of code, or if it's 'no' execute a different block of code.
fr_fr: Le type d'option "Radio" pourrait poser une question. Par exemple, "Voulez-vous activer la navigation personnalisée?" pourrait nécessiter une réponse oui ou non avec une option radio. Dans cette situation, vous pouvez tester si la radio a une valeur de «oui» et d'exécuter un bloc de code, ou si c'est «non» d'exécuter un autre bloc de code.

source: the Radio Images option type is primarily used for layouts. However, you can filter the image list using <code>ot_radio_images</code>. As well, you can add your own custom images using the choices array.
fr_fr: Le type d'option "Radio Images" est principalement utilisé pour les mises en pages. Cependant, vous pouvez filtrer la liste des images à l'aide <code>ot_radio_images</code>. En outre, vous pouvez ajouter vos propres images personnalisées à l'aide du tableau de choix.

source: This example executes the <code>ot_radio_images</code> filter on layout images attached to the <code>my_radio_images</code> field. Added to <code>functions.php</code>.
fr_fr: Cet exemple exécute le filtre <code>ot_radio_images</code> sur les images de mises en page attachés au champ <code>my_radio_images</code>. Ajouté à <code>functions.php</code>.

source: The Select option type is used to list anything you want that would be chosen from a select list.
fr_fr: Le type d'option Liste déroulante est utilisé pour lister ce que vous voulez qui puisse être choisi dans une liste déroulante.

source: The Slider option type is technically deprecated. Use the List Item option type instead, as it's infinitely more customizable. Typical use is for creating sliding image content.
fr_fr: Le type d'option Slider est techniquement déprécié. Utilisez le type d'option "Liste d'éléments" à la place, comme il est infiniment plus personnalisable. Une utilisation typique est pour la création de contenu d'images coulissantes.

source: The Tag Checkbox option type displays a list of tag IDs. It allows the user to check multiple tag IDs and will return that value as an array for use in a custom function or loop.
fr_fr: Le type d'option " Case à cocher de Tag" affiche une liste d'ID de tag. Il permet à l'utilisateur de sélectionner un ou plusieurs ID de Tag et renvoie cette valeur comme un tableau pour une utilisation dans une fonction personnalisée ou une boucle.

source: The Tag Select option type displays a list of tag IDs. It allows the user to select only one tag ID and will return that value for use in a custom function or loop.
fr_fr: Le type d'option "Liste déroulante de Tag" affiche une liste d'ID de Tag. Il permet à l'utilisateur de sélectionner un seul Tag et retournera cette valeur pour une utilisation dans une fonction personnalisée ou une boucle.

source: The Taxonomy Checkbox option type displays a list of taxonomy IDs. It allows the user to check multiple taxonomy IDs and will return that value as an array for use in a custom function or loop.
fr_fr: Le type d'option "Case à cocher de taxonomie (Taxonomy Checkbox)" option affiche une liste d'ID de taxonomie. Il permet à l'utilisateur de sélectionner une ou plusieurs ID de taxonomie et retournera cette valeur comme un tableau pour une utilisation dans une fonction personnalisée ou une boucle.

source: The Taxonomy Select option type displays a list of taxonomy IDs. It allows the user to select only one taxonomy ID and will return that value for use in a custom function or loop.
fr_fr: Le type d'option "Liste déroulante de toxonomie (Taxonomy Select)" affiche une liste d'ID de taxonomie. Il permet à l'utilisateur de sélectionner une seule ID de taxonomie et retournera cette valeur pour une utilisation dans une fonction personnalisée ou une boucle.

source: Text (Input)
fr_fr: Texte (En entréé)

source: The Text option type would be used to save a string value. For example, a link to feedburner, your Twitter username, or Google Analytics ID are all good candidates. Any optional or required text that is of reasonably short character length.
fr_fr: Le type d'option "Texte" serait utilisé pour enregistrer une valeur de chaîne de caractère. Par exemple, un lien vers feedburner, votre nom d'utilisateur Twitter, ou votre identifiant Google Analytics sont tous de bons candidats. Tout texte facultatif ou obligatoire qui est d'une longueur de caractère raisonnablement court.

source: The Textarea option type is a large string value used for custom code or text in the theme. The new Textarea has a WYSIWYG editor that can be filtered to change the buttons shown. For example, you can filter on <code>wpautop</code>, <code>media_buttons</code>, <code>tinymce</code>, and <code>quicktags</code>.
fr_fr: Le type d'option "Zone de texte (Textarea)" est une grande chaîne de caractère utilisée pour du code personnalisé ou un texte dans le thème. La nouvelle "Zone de texte (Textarea)" a un éditeur WYSIWYG qui peut être filtré pour changer les boutons affichés. Par exemple, vous pouvez filtrer sur <code>wpautop</code>, <code>media_buttons</code>, <code>tinymce</code>, and <code>quicktags</code>.

source: Example filters to alter the Textarea option type. Added to <code>functions.php</code>.
fr_fr: Exemples de filtres pour modifier le type d'option "Zone de texte (Textarea)". Ajouté à <code>functions.php</code>.

source: This example keeps WordPress from executing the <code>wpautop</code> filter on the line breaks. The default is <code>true</code> which means it wraps line breaks with an HTML <code>p</code> tag.
fr_fr: Cet exemple empêche WordPress d'exécuterle filtre <code>wpautop</code> sur les sauts de ligne. La valeur par défaut est <code>true</code> ce qui signifie qu'il enveloppe les sauts de ligne avec une balise HTML <code>p</code>.

source: This example keeps WordPress from executing the <code>media_buttons</code> filter on the textarea WYSIWYG. The default is <code>true</code> which means show the buttons.
fr_fr: Cet exemple empêche Wordpress d'exécuter le filtre <code>media_buttons</code> sur la zone de texte WYSIWYG. La valeur par défaut est <code>true</code> qui signifie "montrer les boutons".

source: This example keeps WordPress from executing the <code>tinymce</code> filter on the textarea WYSIWYG. The default is <code>true</code> which means show the tinymce.
fr_fr: Cet exemple empêche Wordpress d'exécuter le filtre <code>tinymce</code> sur la zone de texte WYSIWYG. La valeur par défaut est <code>true</code> qui signifie "montrer le tinymce".

source: This example alters the <code>quicktags</code> filter on the textarea WYSIWYG. The default is <code>array( 'buttons' => 'strong,em,link,block,del,ins,img,ul,ol,li,code,spell,close' )</code> which means show those quicktags. It also means you can filter in your own custom quicktags.
fr_fr: Cet exemple empêche Wordpress d'exécuter le filtre <code>quicktags</code> sur la zone de texte WYSIWYG. La valeur par défaut est <code>array( 'buttons' => 'strong,em,link,block,del,ins,img,ul,ol,li,code,spell,close' )</code> qui signifie "montrer ces quicktags".Il signifie également que vous pouvez filtrer vos propres quicktags personnalisés.

source: The Textarea Simple option type is a large string value used for custom code or text in the theme. The new Textarea Simple does not have a WYSIWYG editor. But you can still filter on <code>wpautop</code>.
fr_fr: Le type d'option "Zone de texte simple (Textarea Simple)" est une valeur chaîne de caractère de grande taille utilisée pour du code ou un texte personnalisé dans le thème. La "Zone de texte simple (Textarea Simple)" n'a pas un éditeur WYSIWYG. Mais vous pouvez toujours filtrer sur <code>wpautop</code>.

source: This example tells WordPress to execute the <code>wpautop</code> filter on the line breaks. The default is <code>false</code> which means it does not wraps line breaks with an HTML <code>p</code> tag. Added to <code>functions.php</code>.
fr_fr: Cet exemple demande à WordPress d'exécuter le filtre <code>wpautop</code> sur les sauts de ligne. La valeur par défaut est <code>false</code> ce qui signifie qu'il n'englobe pas les sauts de ligne avec une balise HTML <code>p</code>. Ajouté à <code>functions.php</code>.

source: The Textblock option type is used only on the Theme Option page. It will allow you to create & display HTML on your Theme Options page but has no title above the text block. You can then use the Textblock to add a more detailed set of instruction on how the options are used in your theme. You would NEVER use this in your themes template files as it does not save a value.
fr_fr: Le type d'option "Bloc de texte (TextBlock)" est utilisé uniquement sur la page d'option du thème. Il vous permettra de créer et afficher du code HTML sur la page des options du thème, mais n'a pas de titre au-dessus du bloc de texte. Vous pouvez utiliser le "Bloc de texte (TextBlock)" pour ajouter un ensemble plus détaillé d'instructions sur la façon dont les options sont utilisées dans votre thème. Vous ne devez JAMAIS l'utiliser dans vos fichiers de modèle de thème car il ne sauve pas de valeur.

source: The Textblock Titled option type is used only on the Theme Option page. It will allow you to create & display HTML on your Theme Options page and has a title above the text block. You can then use the Textblock Titled to add a more detailed set of instruction on how the options are used in your theme. You would NEVER use this in your themes template files as it does not save a value.
fr_fr: Le type d'option "Bloc de texte avec titre (Textblock Titled)" est utilisé uniquement sur la page "Option du Thème". Il vous permettra de créer et afficher le code HTML sur la page "Option du Thème" et dispose d'un titre au-dessus du bloc de texte. Vous pouvez ensuite utiliser le "Bloc de texte avec titre (Textblock Titled)" pour ajouter un ensemble plus détaillé d'instructions sur la façon dont les options sont utilisées dans votre thème. Vous ne devez JAMAIS l'utiliser dans vos fichiers de modèle de thème car il ne sauve pas de valeur.

source: The Typography option type is for adding typographic styles to your theme either dynamically via the CSS option type below or manually with <code>ot_get_option()</code>. Typography has filters that allow you to change the defaults. For example, you can filter on <code>ot_recognized_font_styles</code>, <code>ot_recognized_font_weights</code>, <code>ot_recognized_font_variants</code>, and <code>ot_recognized_font_families</code>. These filters allow you to fine tune the select lists for your specific CSS needs. The most important one though is <code>ot_recognized_font_families</code> as you can add your Google Fonts to create custom font stacks.
fr_fr: Le type d'option "Typographie" est pour l'ajout de styles typographiques à votre thème soit dynamiquement via le type d'option CSS ci-dessous ou manuellement avec <code>ot_get_option()</code>. Typographie est doté de filtres qui vous permettent de changer les valeurs par défaut. Par exemple, vous pouvez filtrer par <code>ot_recognized_font_styles</code>, <code>ot_recognized_font_weights</code>, <code>ot_recognized_font_variants</code>, and <code>ot_recognized_font_families</code>. Ces filtres vous permettent d'affiner les listes de sélection pour vos besoins spécifiques CSS. Le plus important cependant est <code>ot_recognized_font_families</code> comme vous pouvez ajouter vos polices de Google pour créer des groupements de polices personnalisés.

source: This example would filter <code>ot_recognized_font_families</code> to build your own font stack. Added to <code>functions.php</code>.
fr_fr: Cet exemple filtrerait <code>ot_recognized_font_families</code> pour construire votre propre groupement de polices. Ajouté à <code>functions.php</code>.

source: The Upload option type is used to upload any WordPress supported media. After uploading, users are required to press the "Send to OptionTree" button in order to populate the input with the URI of that media. There is one caveat of this feature. If you import the theme options and have uploaded media on one site the old URI will not reflect the URI of your new site. You'll have to re-upload or FTP any media to your new server and change the URIs if necessary.
fr_fr: Le type d'option "Téléversement (Upload)" est utilisé pour téléverser(envoyer sur un serveur, le contraire de télécharger) tous les médias soutenus par WordPress. Après le téléversement (Upload), les utilisateurs doivent appuyer sur le bouton "Envoyer à OptionTree" afin d'afficher dans le champ l'URI du média. Il y a une mise en garde de cette fonctionnalité. Si vous importez les options du thème que vous aviez téléversé sur un site, l'ancienne URI est différente de l'URI de votre nouveau site. Vous aurez à re-téléverser ou envoyer par FTP tous les médias vers votre nouveau serveur et de modifier l'URI, si nécessaire.

source: This function returns a value from the "option_tree" array of saved values or the default value supplied. The returned value would be mixed. Meaning it could be a string, integer, boolean, or array.
fr_fr: Cette fonction retourne une valeur depuis le tableau "option_tree" de valeurs enregistrées ou la valeur par défaut fournie. La valeur retournée serait mixte. Ce qui signifie quelle pourrait être une chaîne, un entier, un booléen ou un tableau.

source: Parameters
fr_fr: Paramètres

source: string
fr_fr: chaîne de caractère

source: required
fr_fr: requis

source: Enter the options unique identifier.
fr_fr: Entrez l'identifiant unique des options.

source: Default:
fr_fr: Par défaut:

source: None
fr_fr: Aucun

source: optional
fr_fr: optionnel

source: Enter a default return value. This is just incase the request returns null.
fr_fr: Entrez une valeur de retour par défaut. C'est juste au cas où la demande renvoie null.

source: Default
fr_fr: Par défaut

source: This function has been deprecated. That means it has been replaced by a new function or is no longer supported, and may be removed from future versions. All code that uses this function should be converted to use its replacement.
fr_fr: Cette fonction a été dépréciée. Cela signifie qu'elle a été remplacé par une nouvelle fonction ou n'est plus supportée, et peut être enlevée des futures versions. Tout le code qui utilise cette fonction devrait être converti pour utiliser son remplacant.

source: Use
fr_fr: Utiliser

source: instead
fr_fr: à la place

source: This function returns, or echos if asked, a value from the "option_tree" array of saved values.
fr_fr: Cette fonction retourne, ou affiche par "echo" si on lui demande, une valeur du tableau "option_tree" des valeurs enregistrées.

source: Enter a unique Option Key to get a returned value or array.
fr_fr: Entrez une clé d'option unique pour obtenir une valeur retournée ou un tableau.

source: array
fr_fr: tableau

source: Used to cut down on database queries in template files.
fr_fr: Utilisé pour réduire les requêtes de bases de données dans les fichiers modèles.

source: boolean
fr_fr: booléen

source: Echo the output.
fr_fr: Affiche la sortie.

source: Used to indicate the $item_id is an array of values.
fr_fr: Utilisé pour indiquer si $item_id est un tableau de valeurs.

source: integer
fr_fr: entier

source: Numeric offset key for the $item_id array, -1 will return all values (an array starts at 0).
fr_fr: Clé numérique de décalage pour le tableau $item_id, -1 renverra toutes les valeurs (un tableau commence à 0).

source: If you're using the plugin version of OptionTree it is highly recommended to include a <code>function_exists</code> check in your code, as described in the examples below. If you've integrated OptionTree directly into your themes root directory, you will <strong>not</strong> need to wrap your code with <code>function_exists</code>, as you're guaranteed to have the <code>ot_get_option()</code> function available.
fr_fr: Si vous utilisez la version du plugin de OptionTree il est fortement recommandé d'inclure une vérification <code>function_exists</code> dans votre code, tel que décrit dans les exemples ci-dessous. Si vous avez intégré OptionTree directement dans votre arborescence de répertoire de votre thème, vous n'aurez <strong>pas</strong> besoin d'envelopper votre code avec <code>function_exists</code>, car vous êtes assuré d'avoir la fonction <code>ot_get_option()</code> disponible.

source: String Examples
fr_fr: Examples de chaines de caractères

source: Returns the value of <code>test_input</code>.
fr_fr: Retourne la valeur de <code>test_input</code>.

source: Returns the value of <code>test_input</code>, but also has a default value if it returns empty.
fr_fr: Retourne la valeur de <code>test_input</code>, mais a aussi une valeur par défaut si elle retourne une valeur vide.

source: Array Examples
fr_fr: Exemples de tableau

source: Assigns the value of <code>navigation_ids</code> to the variable <code>$ids</code>. It then echos an unordered list of links (navigation) using <code>wp_list_pages()</code>.
fr_fr: Assigne la valeur de <code>navigation_ids</code> à la varialbe <code>$ids</code>. Il affiche ensuite une liste non ordonée de liens (navigation) en utilisant <code>wp_list_pages()</code>.

source: The next two examples demonstrate how to use the <strong>Measurement</strong> option type. The Measurement option type is an array with two key/value pairs. The first is the value of measurement and the second is the unit of measurement.
fr_fr: Les deux exemples suivants montrent comment utiliser le type d'option <strong>Mesure (Measurement)</strong>. Le type d'option "Mesure (Measurement)" est un tableau avec deux paires clé/valeur. Le premier est la valeur de mesure et la seconde l'unité de mesure.

source: This example displays a very basic slider loop.
fr_fr: Cet exemple affiche une boucle de slider très basique.

source: It's Super Simple
fr_fr: C'est super simple

source: Layouts make your theme awesome! With theme options data that you can save/import/export you can package themes with different color variations, or make it easy to do A/B testing on text and so much more. Basically, you save a snapshot of your data as a layout.
fr_fr: Les mises en page rendent votre thème génial! Avec les données d'options du thème que vous pouvez enregistrer/importer/exporter, vous pouvez embarquer dans votre thème des variations de couleurs différentes, ou de faciliter les tests A/B sur le texte et bien plus encore. Fondamentalement, vous enregistrez un instantané de vos données comme une mise en page.

source: Once you have created all your different layouts, or theme variations, you can save them to a separate text file for repackaging with your theme. Alternatively, you could just make different variations for yourself and change your theme with the click of a button, all without deleting your previous options data.
fr_fr: Une fois que vous avez créé toutes vos différentes mises en page , ou des variations de votre thème, vous pouvez les enregistrer dans un fichier texte séparé pour les distribuer avec votre thème. Alternativement, vous pouvez simplement faire des variations différentes pour vous-même et changer votre thème avec le clic d'un bouton, le tout sans la suppression de vos précédentes données sur les options.

source: Adding a layout is ridiculously easy, follow these steps and you'll be on your way to having a WordPress super theme.
fr_fr: Ajouter une mise en page est ridiculement facile, suivez ces étapes et vous serez sur la voie d'avoir un super thème WordPress.

source: For Developers
fr_fr: Pour les développeurs

source: Creating a Layout
fr_fr: Création d'une mise en page

source: Go to the <code>OptionTree->Settings->Layouts</code> tab.
fr_fr: Allez sur l'onglet <code>OptionTree->Paramètres->Mises en page</code>

source: Enter a name for your layout in the text field and hit "Save Layouts", you've created your first layout.
fr_fr: Entrer une nom pour votre mise en page dans le champ texte et cliquer sur "Enregistrer les mises en page", vous avez créer votre première mise en page.

source: Adding a new layout is as easy as repeating the steps above.
fr_fr: Ajout d'une nouvelle mise en page est aussi facile que de répéter les étapes ci-dessus.

source: Activating a Layout
fr_fr: Activer une mise en page

source: Click on the activate layout button in the actions list.
fr_fr: Cliquez sur le bouton "Activer la mise en page" dans la liste des actions.

source: Deleting a Layout
fr_fr: Supprimer une mise en page

source: Click on the delete layout button in the actions list.
fr_fr: Cliquez sur le bouton supprimer mise en page dans la liste des actions.

source: Edit Layout Data
fr_fr: Editer les données de mise en page

source: Go to the <code>Appearance->Theme Options</code> page.
fr_fr: Allez sur la page <code>Apparence->Options du thème</code>
